"""
    Created on 2020/5/27 9:49
    ————————————————————————————————————————————————————————————————————
    @File Name      :  task_7.py.py
    @Author         :  Frank
    @Description    :
    计算两个矩阵相加，例如：
    X = [[12,7,3],
        [4 ,5,6],
        [7 ,8,9]]
    Y = [[5,8,1],
        [6,7,3],
        [4,5,9]]
    
    ————————————————————————————————————————————————————————————————————
    @Change Activity:
  
"""

x = [[12,7,3],
    [4 ,5,6],
    [7 ,8,9]]
y = [[5, 8, 1],
    [6, 7, 3],
    [4, 5, 9]]

res = []
for i in range(len(x)):
    res.append([])
    for j in range(len(x[i])):
        res[i].append(x[i][j] + y[i][j])
print(res)



